AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЦенИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЦенИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastPriceType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИмпортДанныхБрокера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИмпортДанныхБрокера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expectedYield</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>averagePositionPricePt</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currentPrice</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>currency1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>quantityLots</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ticker</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>instrumentUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<BasedOn>
				<xr:Item>Document.ВводНачальныхОстатков</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/БиржеваяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БиржеваяОперация</Name>
			<BasedOn>
				<xr:Item>Document.БиржеваяОперация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыеРезультатыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияTInvest_СТАРЫЙ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// ЗагрузитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей)
// Получает последние цены по инструментам через метод GetLastPrices и записывает их в регистр сведений ТекущиеЦены.
// Параметры:
// Инструменты -- таблица значений с колонкой UID; если не задана, список инструментов определяется по текущим остаткам регистра ПозицииИнструментов
// КоличествоЗаписей -- выходной параметр, количество записанных цен
// Результат:
// выполняется запись данных в регистр ТекущиеЦены
// Особенности:
// отбираются только инструменты с заполненным UID
// инструмент сопоставляется по UID
// если инструмент не найден, выводится сообщение пользователю
Процедура ЗагрузитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей) Экспорт
	
	Если ЗначениеЗаполнено(Инструменты) Тогда
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Инструменты.UID КАК UID,
			|	Инструменты.Ссылка КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
			|		ПО ПозицииИнструментовОстатки.Инструмент = Инструменты.Ссылка
			|ГДЕ
			|	Инструменты.UID <> """"";
		
		Инструменты = Запрос.Выполнить().Выгрузить();
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");
		
	КонецЕсли;
	
	Тело = Новый Структура;
	Тело.Вставить("instrumentId", МассивИдентификаторовИнструментов);
	ТелоJSON = ИнтеграцияTInvest_СТАРЫЙ.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ЦеныПоИнструментам = ИнтеграцияTInvest_СТАРЫЙ.TInvest_ВыполнитьЗапрос("POST", "MarketDataService", "GetLastPrices", ПараметрыЗапроса);
	
	Если Не ЦеныПоИнструментам.Свойство("lastPrices") Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;
	
	lastPrices = ЦеныПоИнструментам.lastPrices;
	Отбор = Новый Структура("UID");
	Источник = Справочники.ИсточникиДанных.ТИнвест;
	
	КоличествоЗаписей = 0;
	Для Каждого СтруктураИнструмента Из lastPrices Цикл
		
		Если СтруктураИнструмента.lastPriceType = "LAST_PRICE_UNSPECIFIED" Тогда
			Продолжить;
		КонецЕсли;
		Если Не СтруктураИнструмента.Свойство("time") Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ИсторияЦенИнструментов.СоздатьМенеджерЗаписи();
		
		Отбор.UID = СтруктураИнструмента.instrumentUid;
		СтрокиИнструмента = Инструменты.НайтиСтроки(Отбор);
		Если СтрокиИнструмента.Количество() = 1 Тогда
			Инструмент = СтрокиИнструмента[0].Ссылка;
		Иначе
			Сообщить("Не найден инструмент по uid " + СтруктураИнструмента.instrumentUid);
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи.Период = ПреобразоватьСтрокуВДату(Лев(СтруктураИнструмента.time, 19));
		МенеджерЗаписи.Инструмент = Инструмент;
		МенеджерЗаписи.Цена = СуммаИзКотировки(СтруктураИнструмента.price);
		МенеджерЗаписи.lastPriceType = СтруктураИнструмента.lastPriceType;
		МенеджерЗаписи.Источник = Источник;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// ЗагрузитьПортфельПоСчету(Счет, currency = Неопределено, ПрочитатьГотовыеДанные = Ложь, СоздатьВводОстатков = Ложь)
// Получает портфель по счёту через GetPortfolio, сохраняет импортированные данные в регистр ИмпортДанныхБрокера и при необходимости создаёт документ ВводНачальныхОстатков.
// Параметры:
// Счет -- счёт в одном из допустимых представлений:
// ссылка на справочник Счета
// строковый AccountId
// строка выборки запроса
// currency -- валюта запроса, в текущей реализации фактически игнорируется, жёстко используется "RUB"
// ПрочитатьГотовыеДанные -- читать ранее сохранённые данные из временного хранилища
// СоздатьВводОстатков -- создавать документ ВводНачальныхОстатков
// Результат:
// записывает позиции в регистр ИмпортДанныхБрокера
// опционально создаёт документ ВводНачальныхОстатков
// Особенности:
// данные сервиса дополнительно сохраняются в справочник ВременноеХранениеДанных
// инструмент определяется по instrumentUid
// Замечания:
// метод сочетает получение, кэширование, импорт и создание документа
// параметр currency сейчас реализован неверно, так как не используется по значению
Процедура ЗагрузитьПортфельПоСчету(Счет, currency = Неопределено, ПрочитатьГотовыеДанные = Ложь, СоздатьВводОстатков = Ложь) Экспорт
	
	Если ТипЗнч(Счет) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		AccountId = Счет.AccountId;
		СчетСсылка = Счет.Ссылка;
	ИначеЕсли ТипЗнч(Счет) = Тип("Строка") Тогда
		AccountId = Счет;
		СчетСсылка = Справочники.Счета.НайтиПоРеквизиту("AccountId", AccountId);
	ИначеЕсли ТипЗнч(Счет) = Тип("СправочникСсылка.Счета") Тогда
		AccountId = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "AccountId");
		СчетСсылка = Счет;
	Иначе
		ВызватьИсключение "неизвестный тип данных в процедуре ПортфельПоСчету - " + ТипЗнч(Счет);
	КонецЕсли;
	Тело = Новый Структура;
	Тело.Вставить("accountId", AccountId);
	Тело.Вставить("currency", "RUB");
	ТелоJSON = ИнтеграцияTInvest_СТАРЫЙ.TInvest_СериализоватьВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ДанныеСервиса = ИнтеграцияTInvest_СТАРЫЙ.TInvest_ВыполнитьЗапрос("POST", "OperationsService", "GetPortfolio", ПараметрыЗапроса);
	
	Если ПрочитатьГотовыеДанные Тогда
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.НайтиПоКоду("000000001");
		ДанныеСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВременноеХранениеДанных, "ХранилищеЗначения").Получить();
	Иначе
		ВременноеХранениеДанных = Справочники.ВременноеХранениеДанных.СоздатьЭлемент();
		ВременноеХранениеДанных.ХранилищеЗначения = Новый ХранилищеЗначения(ДанныеСервиса, Новый СжатиеДанных(9));
		ВременноеХранениеДанных.Записать();
		ОбщегоНазначения.СообщитьПользователю("Записаны данные " + ВременноеХранениеДанных, ВременноеХранениеДанных);
	КонецЕсли;

	Если Не ДанныеСервиса.Свойство("positions") Тогда
		Сообщить("Нет данных");
		Возврат;
	КонецЕсли;
	
	positions = ДанныеСервиса.positions;
	
	Источник = Справочники.ИсточникиДанных.ТИнвест;
	КоличествоЗаписей = 0;
	Для Каждого position Из positions Цикл
		
		МенеджерЗаписи = РегистрыСведений.ИмпортДанныхБрокера.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(position.instrumentUid);
		МенеджерЗаписи.instrumentUid = position.instrumentUid;
		МенеджерЗаписи.averagePositionPrice = СуммаИзКотировки(position.averagePositionPrice);
		МенеджерЗаписи.currency = position.averagePositionPrice.currency;
		МенеджерЗаписи.averagePositionPricePt = СуммаИзКотировки(position.averagePositionPricePt);
		МенеджерЗаписи.currency1 = position.averagePositionPrice.currency;
		МенеджерЗаписи.expectedYield = СуммаИзКотировки(position.expectedYield);
		МенеджерЗаписи.quantityLots = СуммаИзКотировки(position.quantityLots);
		МенеджерЗаписи.ticker = position.ticker;
		МенеджерЗаписи.Источник = Источник;
		МенеджерЗаписи.Счет = СчетСсылка;

		МенеджерЗаписи.Записать();
		КоличествоЗаписей = КоличествоЗаписей + 1;

	КонецЦикла;
	
	Если СоздатьВводОстатков Тогда
		ДокВвод = Документы.ВводНачальныхОстатков.СоздатьДокумент();
		ДокВвод.Дата = МенеджерЗаписи.Период;
		ДанныеЗаполнения = Новый Структура("Дата, Счет", ТекущаяДатаСеанса(), СчетСсылка);
		ДокВвод.Заполнить(ДанныеЗаполнения);
		Попытка
			ДокВвод.Записать();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан документ %1, количество позиций: %2", ДокВвод.Ссылка, КоличествоЗаписей), ДокВвод.Ссылка);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Загружены данные по счету %1, количество позиций: %2", СчетСсылка, КоличествоЗаписей));
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьПортфельПоСчету

// Функция TInvest_ПолучитьОперации(AccountId, ДатаС, ДатаПо, Состояние = "OPERATION_STATE_EXECUTED", FIGI = "", Песочница = Ложь)
// Получает список операций по счёту за период через метод GetOperations.
// Параметры:
// AccountId -- идентификатор счёта
// ДатаС -- начало периода
// ДатаПо -- конец периода
// Состояние -- фильтр по состоянию операции
// FIGI -- фильтр по инструменту
// Песочница -- использовать sandbox API
// Возвращаемое значение:
// Ответ API T-Invest по методу GetOperations.
// Особенности:
// выполняется проверка обязательных параметров
// даты передаются в ISO-формате
Функция TInvest_ПолучитьОперации(AccountId, ДатаС, ДатаПо, 
	Состояние = "OPERATION_STATE_EXECUTED", FIGI = "", Песочница = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(AccountId) Тогда
		ВызватьИсключение "Не задан accountId";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаС) Или НЕ ЗначениеЗаполнено(ДатаПо) Тогда
		ВызватьИсключение "Не задан период (ДатаС/ДатаПо)";
	КонецЕсли;
	
	// Важно: API ожидает date-time в UTC строкой.
	// Здесь я даю простой формат ISO без миллисекунд.
	// Если у тебя даты уже локальные (через XMLЗначение), то это “локальный момент”, но строка будет без 'Z'.
	// Для MVP обычно достаточно: API принимает date-time строку, в документации указано UTC. :contentReference[oaicite:7]{index=7}
	Тело = Новый Структура;
	Тело.Вставить("accountId", AccountId);
	Тело.Вставить("from", Формат(ДатаС, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
	Тело.Вставить("to",   Формат(ДатаПо, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		Тело.Вставить("state", Состояние);
	КонецЕсли;
	Если ЗначениеЗаполнено(FIGI) Тогда
		Тело.Вставить("figi", FIGI);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура("Тело", Тело);
	
	Возврат TInvest_ВыполнитьЗапрос("POST",
		"OperationsService",
		"GetOperations",
		ПараметрыЗапроса,
		Песочница);
		
КонецФункции

// Функция TInvest_ПолучитьОперацииПоКурсору(AccountId, ДатаС, ДатаПо, 
//   Лимит = 1000, Состояние = "OPERATION_STATE_EXECUTED", 
//   InstrumentId = "", Песочница = Ложь) Экспорт
// Получает операции по счёту за период через cursor-based API GetOperationsByCursor с автоматической выборкой всех страниц.
// Параметры:
// AccountId -- идентификатор счёта
// ДатаС -- начало периода
// ДатаПо -- конец периода
// Лимит -- размер страницы
// Состояние -- фильтр по состоянию
// InstrumentId -- фильтр по инструменту
// Песочница -- использовать sandbox API
// Возвращаемое значение:
// Массив операций, собранный из всех страниц ответа.
// Особенности:
// автоматически обрабатывает nextCursor / hasNext
// возвращает плоский массив операций
// поддерживает несколько вариантов структуры ответа (items, operations)
Функция TInvest_ПолучитьОперацииПоКурсору(AccountId, ДатаС, ДатаПо, 
	Лимит = 1000, Состояние = "OPERATION_STATE_EXECUTED", 
	InstrumentId = "", Песочница = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(AccountId) Тогда
		ВызватьИсключение "Не задан accountId";
	КонецЕсли;
	
	Если Лимит <= 0 Тогда
		Лимит = 100;
	ИначеЕсли Лимит > 1000 Тогда
		Лимит = 1000;
	КонецЕсли;
	
	Результат = Новый Массив;
	Курсор = "";
	
	Пока Истина Цикл
		
		Тело = Новый Структура;
		Тело.Вставить("accountId", AccountId);
		Тело.Вставить("from", Формат(ДатаС, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
		Тело.Вставить("to",   Формат(ДатаПо, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
		Тело.Вставить("limit", Лимит);
		
		Если ЗначениеЗаполнено(Состояние) Тогда
			Тело.Вставить("state", Состояние);
		КонецЕсли;
		
		// instrumentId может быть UID или FIGI (по доке) :contentReference[oaicite:9]{index=9}
		Если ЗначениеЗаполнено(InstrumentId) Тогда
			Тело.Вставить("instrumentId", InstrumentId);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Курсор) Тогда
			Тело.Вставить("cursor", Курсор);
		КонецЕсли;
		
		ПараметрыЗапроса = Новый Структура("Тело", Тело);
		Ответ = TInvest_ВыполнитьЗапрос("POST",
			"OperationsService",
			"GetOperationsByCursor",
			ПараметрыЗапроса,
			Песочница);
		
		Если Ответ = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		// В ответе: items/elements + nextCursor/hasNext (зависит от схемы)
		// По доке это cursor-ответ, так что ориентируйся на свойства курсора.
		Если Ответ.Свойство("items") Тогда
			Для Каждого Операция Из Ответ.items Цикл
				Результат.Добавить(Операция);
			КонецЦикла;
		ИначеЕсли Ответ.Свойство("operations") Тогда
			Для Каждого Операция Из Ответ.operations Цикл
				Результат.Добавить(Операция);
			КонецЦикла;
		КонецЕсли;
		
		ЕстьСледующий = Ложь;
		Если Ответ.Свойство("hasNext") Тогда
			ЕстьСледующий = Ответ.hasNext;
		КонецЕсли;
		
		Если Ответ.Свойство("nextCursor") Тогда
			Курсор = Ответ.nextCursor;
		ИначеЕсли Ответ.Свойство("cursor") Тогда
			// иногда возвращают просто cursor
			Курсор = Ответ.cursor;
		Иначе
			Курсор = "";
		КонецЕсли;
		
		Если НЕ ЕстьСледующий Или НЕ ЗначениеЗаполнено(Курсор) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура TI_ИмпортироватьОперацииВБиржевыеОперации(Счет, ИсточникДанных, Операции)
// Импортирует массив операций T-Invest в документы предметного учёта.
// Параметры:
// Счет -- счёт учета
// ИсточникДанных -- ссылка на справочник источников данных
// Операции -- массив операций API
// Результат:
// создаёт или обновляет документы по операциям покупки/продажи
// подтягивает комиссию по связанным операциям
// Особенности:
// обрабатываются только операции покупки и продажи
// выполняется антидублирование по OperationId
// для существующего документа без заполненной стратегии допускается обновление
// операция сопоставляется по instrumentUid
Процедура TI_ИмпортироватьОперацииВБиржевыеОперации(Счет, ИсточникДанных, Операции) Экспорт
	
	КомиссииПоРодителю = TI_СобратьКомиссииПоРодителю(Операции);

	Для Каждого Операция Из Операции Цикл

		Если НЕ Операция.Свойство("operationType") Тогда
			Продолжить;
		КонецЕсли;

		// Берём только покупки/продажи. Комиссии подтянем по parentOperationId.
		Если Операция.operationType <> "OPERATION_TYPE_BUY"
		   И Операция.operationType <> "OPERATION_TYPE_SELL" Тогда
			Продолжить;
		КонецЕсли;

		OperationId = Операция.id;
		Если НЕ ЗначениеЗаполнено(OperationId) Тогда
			Продолжить;
		КонецЕсли;

		// анти-дубль
		ДокументБиржеваяОперацияСсылка = TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId);
		Если ДокументБиржеваяОперацияСсылка = Неопределено Тогда
			ДокументБиржеваяОперация = Документы.БиржеваяОперация.СоздатьДокумент();
		Иначе
			СтратегияСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБиржеваяОперацияСсылка, "СтратегияСделки");
			Если ЗначениеЗаполнено(СтратегияСделки) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Биржевая операция %1 уже проведена, не загружаем повторно", ДокументБиржеваяОперацияСсылка), ДокументБиржеваяОперацияСсылка);
				Продолжить;
			Иначе
				ДокументБиржеваяОперация = ДокументБиржеваяОперацияСсылка.ПолучитьОбъект();
				ДокументБиржеваяОперация.Позиции.Очистить();
			КонецЕсли;
		КонецЕсли;

		// инструмент по instrumentUid (предпочтительнее, чем FIGI)
		InstrumentUid = Операция.instrumentUid;
		Если НЕ ЗначениеЗаполнено(InstrumentUid) Тогда
			// fallback на figi, если захочешь
			Продолжить;
		КонецЕсли;

		Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(InstrumentUid);

		ДокументБиржеваяОперация.Счет = Счет;
		ДокументБиржеваяОперация.Дата = ПреобразоватьСтрокуВДату(Операция.date);
		ДокументБиржеваяОперация.ВидСделки = 
			?(Операция.operationType = "OPERATION_TYPE_BUY",
			  Перечисления.ВидыСделок.Покупка,
			  Перечисления.ВидыСделок.Продажа);
			  
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Операция.currency);
		ДокументБиржеваяОперация.ВалютаСделки = Валюта;
		Если Операция.currency = "rub" Тогда
			ДокументБиржеваяОперация.КурсСделки = 1;
		Иначе
			ДокументБиржеваяОперация.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(ДокументБиржеваяОперация.Дата, Валюта);
		КонецЕсли;
		ДокументБиржеваяОперация.OperationId = Операция.id;
		ДокументБиржеваяОперация.Источник = ИсточникДанных;

		Стр = ДокументБиржеваяОперация.Позиции.Добавить();

		Стр.Инструмент = Инструмент;

		Количество = Число(Операция.quantity);
		Стр.Количество = Количество;

		РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "РазмерЛота");
		Если РазмерЛота <> 0 Тогда
			Стр.КоличествоЛотов = Количество / РазмерЛота;
		Иначе
			Стр.КоличествоЛотов = Количество;
		КонецЕсли;

		Стр.Цена = СуммаИзКотировки(Операция.price);

		Комиссия = КомиссииПоРодителю.Получить(Операция.id);
		Если Комиссия = Неопределено Тогда Комиссия = 0; КонецЕсли;
		Стр.Комиссия = Комиссия;

		ДокументБиржеваяОперация.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Записан документ %1", ДокументБиржеваяОперация.Ссылка), ДокументБиржеваяОперация.Ссылка);

	КонецЦикла;

КонецПроцедуры // TI_ИмпортироватьОперацииВБиржевыеОперации

// Функция TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации(Счет, ИсточникДанных, ОтветКурсора)
// Импортирует операции из cursor-ответа T-Invest в документы БиржеваяОперация.
// Параметры:
// Счет -- счёт учета
// ИсточникДанных -- источник данных
// ОтветКурсора -- массив операций или структура ответа cursor API
// Результат:
// создаёт или обновляет документы БиржеваяОперация
// Особенности:
// поддерживает входные данные в разных форматах (Массив, items, operations)
// определяет тип операции через TI_ТипОперации
// комиссии собираются через TI_СобратьКомиссииПоРодителюУниверсально
// выполняется антидублирование по OperationId
Процедура TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации(Счет, ИсточникДанных, ОтветКурсора) Экспорт

	Если ОтветКурсора = Неопределено Тогда Возврат; КонецЕсли;

	// В cursor-ответе обычно items, но подстрахуемся.
	Операции = Неопределено;
	Если ТипЗнч(ОтветКурсора) = Тип("Массив") Тогда
		Операции = ОтветКурсора;
	ИначеЕсли ОтветКурсора.Свойство("items") Тогда
		Операции = ОтветКурсора.items;
	ИначеЕсли ОтветКурсора.Свойство("operations") Тогда
		Операции = ОтветКурсора.operations;
	Иначе
		Возврат;
	КонецЕсли;

	КомиссииПоРодителю = TI_СобратьКомиссииПоРодителюУниверсально(Операции);

	Для Каждого Операция Из Операции Цикл

		ТипОпер = TI_ТипОперации(Операция);

		// Иногда type человекочитаемый. Тогда пытаемся опознать по operationTypeName/operationType не вышло.
		Если ТипОпер = "Покупка ценных бумаг" Тогда ТипОпер = "OPERATION_TYPE_BUY"; КонецЕсли;
		Если ТипОпер = "Продажа ценных бумаг" Тогда ТипОпер = "OPERATION_TYPE_SELL"; КонецЕсли;

		Если ТипОпер <> "OPERATION_TYPE_BUY"
		   И ТипОпер <> "OPERATION_TYPE_SELL" Тогда
			Продолжить;
		КонецЕсли;

		OperationId = TI_ПолучитьСвойство(Операция, "id");
		Если НЕ ЗначениеЗаполнено(OperationId) Тогда Продолжить; КонецЕсли;

		// анти-дубль / обновление
		ДокументБиржеваяОперацияСсылка = TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId);
		Если ДокументБиржеваяОперацияСсылка = Неопределено Тогда
			ДокументБиржеваяОперация = Документы.БиржеваяОперация.СоздатьДокумент();
		Иначе
			СтратегияСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБиржеваяОперацияСсылка, "СтратегияСделки");
			Если ЗначениеЗаполнено(СтратегияСделки) Тогда
				Продолжить;
			Иначе
				ДокументБиржеваяОперация = ДокументБиржеваяОперацияСсылка.ПолучитьОбъект();
				// можно очистить ТЧ, если хочешь “перезалить”
				ДокументБиржеваяОперация.Позиции.Очистить();
			КонецЕсли;
		КонецЕсли;

		InstrumentUid = TI_ПолучитьСвойство(Операция, "instrumentUid");
		Если НЕ ЗначениеЗаполнено(InstrumentUid) Тогда
			Продолжить;
		КонецЕсли;

		Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(InstrumentUid);

		ДатаISO = TI_ПолучитьСвойство(Операция, "date", "dateTime");
		ДокументБиржеваяОперация.Дата = ПреобразоватьСтрокуВДату(ДатаISO);

		ДокументБиржеваяОперация.Счет = Счет;
		ДокументБиржеваяОперация.ВидСделки =
			?(ТипОпер = "OPERATION_TYPE_BUY",
			  Перечисления.ВидыСделок.Покупка,
			  Перечисления.ВидыСделок.Продажа);

		// Валюта: в cursor-формате часто только внутри price/payment
		КодВалюты = TI_ВалютаИзЦеныИлиПлатежа(Операция);
		Если ЗначениеЗаполнено(КодВалюты) Тогда
			Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалюты);
			ДокументБиржеваяОперация.ВалютаСделки = Валюта;

			Если КодВалюты = "rub" Тогда
				ДокументБиржеваяОперация.КурсСделки = 1;
			Иначе
				ДокументБиржеваяОперация.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(ДокументБиржеваяОперация.Дата, Валюта);
			КонецЕсли;
		КонецЕсли;

		ДокументБиржеваяОперация.OperationId = OperationId;
		ДокументБиржеваяОперация.Источник = ИсточникДанных;

		ДокументБиржеваяОперация.Инструмент = Инструмент;

		Количество = Число(TI_ПолучитьСвойство(Операция, "quantity", "quantityUnits"));
		ДокументБиржеваяОперация.Количество = Количество;

		РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "РазмерЛота");
		Если РазмерЛота <> 0 Тогда
			ДокументБиржеваяОперация.КоличествоЛотов = Количество / РазмерЛота;
		Иначе
			ДокументБиржеваяОперация.КоличествоЛотов = Количество;
		КонецЕсли;

		ЦенаСтр = TI_ПолучитьСвойство(Операция, "price");
		Если ЦенаСтр <> Неопределено Тогда
			ДокументБиржеваяОперация.Цена = СуммаИзКотировки(ЦенаСтр);
		Иначе
			// иногда бывает без price, тогда можно оценить через payment/quantity, но лучше пропустить
			ДокументБиржеваяОперация.Цена = 0;
		КонецЕсли;

		Комиссия = КомиссииПоРодителю.Получить(OperationId);
		Если Комиссия = Неопределено Тогда Комиссия = 0; КонецЕсли;
		ДокументБиржеваяОперация.Комиссия = Комиссия;

		ДокументБиржеваяОперация.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Записан документ %1", ДокументБиржеваяОперация.Ссылка), ДокументБиржеваяОперация.Ссылка);

	КонецЦикла;

КонецПроцедуры // TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Комментарий, ИсточникДанных)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с API'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , ИсточникДанных, Комментарий);
	
КонецПроцедуры

Функция ТекстОшибки(ТекстОшибки)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Подробности см. в журнале регистрации.'");
	КонецЕсли;
	
	Возврат ТекстОшибки + Символы.ПС + НСтр("ru = 'Обратитесь к администратору.'");
	
КонецФункции

Функция TInvest_ВыполнитьЗапрос(Метод = "POST", РазделAPI, ИмяКоманды, ПараметрыЗапроса, Песочница = Ложь)
	
	РеквизитыИсточникаДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.ИсточникиДанных.ТИнвест, "Адрес, Путь, Порт");
	
	Если ПараметрыЗапроса.Свойство("Токен") И ЗначениеЗаполнено(ПараметрыЗапроса.Токен) Тогда
		Токен = ПараметрыЗапроса.Токен;
	Иначе
		Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ИсточникиДанных");
		ИмяСервиса = Справочники.ИсточникиДанных.ТИнвест.Наименование;
		Токен = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, ИмяСервиса);
	КонецЕсли;
	
	// Host для REST-прокси
	Хост = ?(Песочница, "sandbox-invest-public-api.tbank.ru", РеквизитыИсточникаДанных.Адрес);
	Порт = РеквизитыИсточникаДанных.Порт;

	// Путь метода (REST proxy)
	Путь = РеквизитыИсточникаДанных.Путь + "." + РазделAPI + "/" + ИмяКоманды;

	// Тело запроса
	Тело = Неопределено;
	Если ПараметрыЗапроса.Свойство("Тело", Тело) Тогда
		Если ТипЗнч(Тело) = Тип("Строка") Тогда
			ТелоJSON = Тело;
		ИначеЕсли ТипЗнч(Тело) = Тип("Структура") Или ТипЗнч(Тело) = Тип("Массив") Тогда
			ТелоJSON = TInvest_СериализоватьВJSON(Тело);	
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не тот тип параметра запроса 'Тело': " + ТипЗнч(Тело));
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не передан параметр запроса 'Тело'");
		Возврат Неопределено;
	КонецЕсли;

	// HTTPS соединение
	// В большинстве окружений хватит простого HTTPСоединение по 443.
	Таймаут = 10;
	
	НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
	НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
	НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");
	
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);
	
	Соединение = Новый HTTPСоединение(Хост, 443,,, НастройкиПрокси, 1, Истина);
	
	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");

	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния = 404 Тогда
			Результат = Новый Структура("Ошибка, ОписаниеОшибки", Истина, ТекстОшибки);
		Иначе
			// Для отладки удобно вернуть текст ошибки
			ВызватьИсключение СтрШаблон("Сервис T-Invest при обращении к методу %3 сообщил об ошибке: %1. 
							|%2
							|Тело: %4", Ответ.КодСостояния, ТекстОшибки, ИмяКоманды, ТелоJSON);
		КонецЕсли;
	КонецЕсли;

	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Результат = TInvest_ПрочитатьJSON(ТекстОтвета);

	// Обычно в ответе массив инструментов. Конкретное имя поля зависит от схемы ответа в Swagger.
	// Поэтому возвращаем весь разобранный объект, а дальше ты уже выберешь нужное (figi/uid/ticker).
	Возврат Результат;

КонецФункции

Функция TInvest_СериализоватьВJSON(Значение)
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение);
	Возврат Запись.Закрыть();
	
КонецФункции

Функция TInvest_ПрочитатьJSON(СтрокаJSON)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(Чтение);
	
КонецФункции

Функция СуммаИзКотировки(Котировка)
	
	Если Котировка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	// units приходит строкой
	ЦелаяЧасть = Число(Котировка.units);
	ДробнаяЧасть = Котировка.nano / 1000000000;

	Возврат ЦелаяЧасть + ДробнаяЧасть;

КонецФункции

Функция ПреобразоватьСтрокуВДату(Значение)
	
	Если Значение = "1970-01-01T00:00:00" ИЛИ Значение = "1970-01-01T00:00:00Z" Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	Дата = XMLЗначение(Тип("Дата"), Значение);
	Если Год(Дата) = 1970 И Месяц(Дата) = 1 И День(Дата) = 1 Тогда
		Дата = Дата(1, 1, 1);
	КонецЕсли;
	Возврат Дата;

КонецФункции // ПреобразоватьСтрокуВДату()

Функция TI_СобратьКомиссииПоРодителю(Операции)
	Комиссии = Новый Соответствие; // key: parentOperationId, value: сумма комиссии (положительное число)

	Для Каждого Операция Из Операции Цикл
		Если Операция.Свойство("operationType") 
			И Операция.operationType = "OPERATION_TYPE_BROKER_FEE"
			И ЗначениеЗаполнено(Операция.parentOperationId) Тогда

			Сумма = -СуммаИзКотировки(Операция.payment); // payment отрицательный, комиссию храним положительной
			Если Сумма < 0 Тогда
				Сумма = -Сумма;
			КонецЕсли;

			КомиссияСделки = Комиссии.Получить(Операция.parentOperationId);
			Если КомиссияСделки = Неопределено Тогда КомиссияСделки = 0; КонецЕсли;

			Комиссии.Вставить(Операция.parentOperationId, КомиссияСделки + Сумма);
		КонецЕсли;
	КонецЦикла;

	Возврат Комиссии;
КонецФункции

Функция TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БиржеваяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.БиржеваяОперация КАК БиржеваяОперация
	|ГДЕ
	|	БиржеваяОперация.Счет = &Счет
	|	И БиржеваяОперация.OperationId = &OperationId";

	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("OperationId", OperationId);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции // TI_НайтиДокументБиржеваяОперацияПоOperationId

Функция TI_ПолучитьСвойство(СтруктураДанных, Имя1, Имя2 = "", Имя3 = "")
	Если СтруктураДанных = Неопределено Тогда Возврат Неопределено; КонецЕсли;

	Если ЗначениеЗаполнено(Имя1) И СтруктураДанных.Свойство(Имя1) Тогда Возврат СтруктураДанных[Имя1]; КонецЕсли;
	Если ЗначениеЗаполнено(Имя2) И СтруктураДанных.Свойство(Имя2) Тогда Возврат СтруктураДанных[Имя2]; КонецЕсли;
	Если ЗначениеЗаполнено(Имя3) И СтруктураДанных.Свойство(Имя3) Тогда Возврат СтруктураДанных[Имя3]; КонецЕсли;

	Возврат Неопределено;
КонецФункции

Функция TI_ВалютаИзЦеныИлиПлатежа(Операция)
	Цена = TI_ПолучитьСвойство(Операция, "price");
	Если Цена <> Неопределено Тогда
		Вал = TI_ПолучитьСвойство(Цена, "currency");
		Если ЗначениеЗаполнено(Вал) Тогда
			Возврат Вал;
		КонецЕсли;
	КонецЕсли;

	Платеж = TI_ПолучитьСвойство(Операция, "payment");
	Если Платеж <> Неопределено Тогда
		Вал = TI_ПолучитьСвойство(Платеж, "currency");
		Если ЗначениеЗаполнено(Вал) Тогда
			Возврат Вал;
		КонецЕсли;
	КонецЕсли;

	Возврат "";
КонецФункции

Функция TI_ТипОперации(Операция)
	// В разных форматах может быть:
	// operationType: "OPERATION_TYPE_BUY"
	// type: "OPERATION_TYPE_BUY" или человекочитаемое "Покупка ценных бумаг"
	Тип = TI_ПолучитьСвойство(Операция, "operationType");
	Если ЗначениеЗаполнено(Тип) Тогда
		Возврат Тип;
	КонецЕсли;

	Тип = TI_ПолучитьСвойство(Операция, "type");
	Если ЗначениеЗаполнено(Тип) Тогда
		Возврат Тип;
	КонецЕсли;

	Возврат "";
КонецФункции

// TI_СобратьКомиссииПоРодителюУниверсально(Операции)
// Назначение:
// Строит соответствие комиссий по parentOperationId на основании массива операций T-Invest.
// Параметры:
// Операции -- массив операций API
// Возвращаемое значение:
// Соответствие, где:
// ключ -- идентификатор родительской операции
// значение -- сумма комиссии
// Особенности:
// учитывает как отдельные операции комиссии
// так и вложенные childOperations
Функция TI_СобратьКомиссииПоРодителюУниверсально(Операции)
	Комиссии = Новый Соответствие; // key: parentId, value: сумма (положительная)

	Для Каждого Оп Из Операции Цикл

		// 1) Классика: отдельная операция комиссии (BROKER_FEE) с parentOperationId
		Если Оп.Свойство("operationType") И Оп.operationType = "OPERATION_TYPE_BROKER_FEE" Тогда
			ParentId = TI_ПолучитьСвойство(Оп, "parentOperationId");
			Если ЗначениеЗаполнено(ParentId) Тогда
				Сумма = -СуммаИзКотировки(TI_ПолучитьСвойство(Оп, "payment"));
				Если Сумма < 0 Тогда
					Сумма = -Сумма;
				КонецЕсли;
				Тек = Комиссии.Получить(ParentId);
				Если Тек = Неопределено Тогда
					Тек = 0;
				КонецЕсли;
				Комиссии.Вставить(ParentId, Тек + Сумма);
			КонецЕсли;
		КонецЕсли;

		// 2) Cursor/прочие варианты: комиссия в childOperations без id
		ChildOps = TI_ПолучитьСвойство(Оп, "childOperations");
		Если ТипЗнч(ChildOps) = Тип("Массив") Тогда
			Для Каждого Ч Из ChildOps Цикл
				Платеж = TI_ПолучитьСвойство(Ч, "payment");
				Если Платеж <> Неопределено Тогда
					Сумма = -СуммаИзКотировки(Платеж);
					Если Сумма < 0 Тогда
						Сумма = -Сумма;
					КонецЕсли;
					Тек = Комиссии.Получить(Оп.id); 
					Если Тек = Неопределено Тогда
						Тек = 0;
					КонецЕсли;
					Комиссии.Вставить(Оп.id, Тек + Сумма);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Возврат Комиссии;
КонецФункции

#КонецОбласти
